{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "e2d81cd5-b48c-444f-b830-dae153224e62",
            "version": "KqlParameterItem/1.0",
            "name": "Date_Time",
            "type": 4,
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 300000
                },
                {
                  "durationMs": 900000
                },
                {
                  "durationMs": 1800000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2419200000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ],
              "allowCustom": true
            },
            "timeContext": {
              "durationMs": 86400000
            },
            "value": {
              "durationMs": 604800000
            }
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 7"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType != 0 \r\n| where UserAgent == \"BAV2ROPC\"\r\n| summarize count() by UserAgent, bin(TimeGenerated, 1d)\r\n| sort by TimeGenerated desc",
        "size": 0,
        "showAnalytics": true,
        "title": "Legacy Authentication Sign-in Failures",
        "color": "blueDark",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "areachart"
      },
      "showPin": true,
      "name": "query - 0",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType != 0 \r\n| summarize count() by AppDisplayName\r\n| sort by count_ desc ",
        "size": 1,
        "showAnalytics": true,
        "title": "Sign-in Failed Appications",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 3",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType != 0 \r\n| where UserAgent == \"BAV2ROPC\"\r\n| summarize count() by ClientAppUsed",
        "size": 1,
        "showAnalytics": true,
        "title": "Details outlining app auth used",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "piechart",
        "chartSettings": {
          "showMetrics": false,
          "showLegend": true,
          "seriesLabelSettings": [
            {
              "color": "blue"
            },
            {
              "seriesName": "Authenticated SMTP",
              "color": "blueDark"
            }
          ]
        }
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 1",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType != 0 \r\n| where UserAgent == \"BAV2ROPC\"\r\n| summarize count() by UserPrincipalName\r\n| sort by count_ desc \r\n| take 10\r\n",
        "size": 1,
        "showAnalytics": true,
        "title": "Legacy Authentication Sign-in Failed By User (Top - 10)",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "tiles",
        "tileSettings": {
          "titleContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        },
        "graphSettings": {
          "type": 0,
          "topContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "centerContent": {
            "columnMatch": "count_",
            "formatter": 1,
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          }
        }
      },
      "showPin": true,
      "name": "query - 2",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType != 0 \r\n| where UserAgent == \"BAV2ROPC\"\r\n| summarize count() by Location\r\n| sort by count_ desc ",
        "size": 0,
        "showAnalytics": true,
        "title": "Legacy Authentication Sign-in failed By Locations",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart",
        "chartSettings": {
          "showMetrics": false,
          "showLegend": true
        }
      },
      "showPin": true,
      "name": "query - 4",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType == 0 \r\n| where UserAgent == \"BAV2ROPC\"\r\n| summarize count() by Location\r\n| sort by count_ desc ",
        "size": 1,
        "showAnalytics": true,
        "title": "Legacy Authentication Sign-in Success By Locations",
        "color": "blueDark",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart"
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 5",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType == 0 \r\n| where UserAgent == \"BAV2ROPC\"\r\n| summarize count() by IPAddress\r\n| sort by count_ desc ",
        "size": 1,
        "showAnalytics": true,
        "title": "Legacy Authentication Sign-in Success By IP Address",
        "color": "blueDark",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "barchart"
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 5 - Copy",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType == 0 \r\n| where UserAgent == \"BAV2ROPC\"\r\n| summarize count() by UserPrincipalName\r\n| sort by count_ desc \r\n| take 10\r\n",
        "size": 1,
        "showAnalytics": true,
        "title": "Legacy Authentication Sign-in Success By User ",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "tiles",
        "tileSettings": {
          "titleContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        }
      },
      "showPin": true,
      "name": "query - 6",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType == 0\r\n| where AuthenticationRequirement has \"singleFactorAuthentication\"\r\n| extend Browser=tostring(parse_json(DeviceDetail).browser)\r\n| extend DeviceID=tostring(parse_json(DeviceDetail).deviceId)\r\n| extend DisplayName=tostring(parse_json(DeviceDetail).displayName)\r\n| extend OperationSystem=tostring(parse_json(DeviceDetail).operatingSystem)\r\n| extend Type=tostring(parse_json(DeviceDetail).trustType)\r\n| where Type !contains \"Azure AD Registered\"\r\n| where IPAddress !in (\"59.153.111.10\",\"59.153.110.214\",\"59.153.110.170\",\"37.111.41.216\",\"59.153.88.70\")\r\n| summarize count() by UserPrincipalName, AppDisplayName, IPAddress, Location, UserAgent\r\n| sort by count_",
        "size": 1,
        "showAnalytics": true,
        "title": "Single Factor Authentication Success",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "table",
        "tileSettings": {
          "titleContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        }
      },
      "customWidth": "70",
      "showPin": true,
      "name": "Single Factor Aunthentication Logon Success",
      "styleSettings": {
        "maxWidth": "70%",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType == 0\r\n| where AuthenticationRequirement has \"singleFactorAuthentication\"\r\n| extend Browser=tostring(parse_json(DeviceDetail).browser)\r\n| extend DeviceID=tostring(parse_json(DeviceDetail).deviceId)\r\n| extend DisplayName=tostring(parse_json(DeviceDetail).displayName)\r\n| extend OperationSystem=tostring(parse_json(DeviceDetail).operatingSystem)\r\n| extend Type=tostring(parse_json(DeviceDetail).trustType)\r\n| where Type !contains \"Azure AD Registered\"\r\n| where IPAddress !in (\"59.153.111.10\",\"59.153.110.214\",\"59.153.110.170\",\"37.111.41.216\",\"59.153.88.70\")\r\n| summarize count() by AppDisplayName\r\n| sort by count_",
        "size": 1,
        "showAnalytics": true,
        "title": "Single Factor Authentication Success",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "table",
        "tileSettings": {
          "titleContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        }
      },
      "customWidth": "30",
      "showPin": true,
      "name": "Single Factor Aunthentication Logon Success - Copy",
      "styleSettings": {
        "maxWidth": "30%",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType == 0\r\n| where AuthenticationRequirement has \"singleFactorAuthentication\"\r\n| extend Browser=tostring(parse_json(DeviceDetail).browser)\r\n| extend DeviceID=tostring(parse_json(DeviceDetail).deviceId)\r\n| extend DisplayName=tostring(parse_json(DeviceDetail).displayName)\r\n| extend OperationSystem=tostring(parse_json(DeviceDetail).operatingSystem)\r\n| extend Type=tostring(parse_json(DeviceDetail).trustType)\r\n| where Type !contains \"Azure AD Registered\"\r\n| where IPAddress !in (\"59.153.111.10\",\"59.153.110.214\",\"59.153.110.170\",\"37.111.41.216\",\"59.153.88.70\")\r\n| summarize count() by UserPrincipalName\r\n| sort by count_",
        "size": 3,
        "showAnalytics": true,
        "title": "Single Factor Authentication Success",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "tiles",
        "tileSettings": {
          "titleContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        }
      },
      "customWidth": "100",
      "showPin": true,
      "name": "Single Factor Aunthentication Logon Success - Copy",
      "styleSettings": {
        "maxWidth": "100%",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType == 0\r\n//| where AuthenticationRequirement has \"singleFactorAuthentication\"\r\n| extend Browser=tostring(parse_json(DeviceDetail).browser)\r\n| extend DeviceID=tostring(parse_json(DeviceDetail).deviceId)\r\n| extend DisplayName=tostring(parse_json(DeviceDetail).displayName)\r\n| extend OperationSystem=tostring(parse_json(DeviceDetail).operatingSystem)\r\n| extend Type=tostring(parse_json(DeviceDetail).trustType)\r\n| where Type !contains \"Azure AD Registered\"\r\n| where IPAddress !in (\"59.153.111.10\",\"59.153.110.214\",\"59.153.110.170\",\"37.111.41.216\",\"59.153.88.70\")\r\n| where Location !contains \"mm\"\r\n| where UserPrincipalName !in (\"bimsupportsoc@daiichilife.com.mm\")\r\n| extend Authentication = AuthenticationRequirement\r\n| summarize count() by UserPrincipalName, Location\r\n| sort by count_",
        "size": 1,
        "showAnalytics": true,
        "title": "Sign-in Authentication Success From Foreign Country",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "table",
        "gridSettings": {
          "sortBy": [
            {
              "itemKey": "count_",
              "sortOrder": 2
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "count_",
            "sortOrder": 2
          }
        ],
        "tileSettings": {
          "titleContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        },
        "graphSettings": {
          "type": 0,
          "topContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "centerContent": {
            "columnMatch": "count_",
            "formatter": 1,
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          }
        }
      },
      "customWidth": "30",
      "showPin": true,
      "name": "Aunthentication Logon Success from Foreign Country - Copy",
      "styleSettings": {
        "maxWidth": "30%",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let Acount_Login_Threshold = 10;\r\nlet Account_Login_Time = 10m;\r\nSigninLogs\r\n| where ResultType != 0\r\n| where TimeGenerated >= ago(7d)\r\n| summarize Failed_Attempts = count(),  StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) , IPAddress = make_set(IPAddress,100), Location = make_set(Location, 100), Description = make_set(ResultDescription, 100) by UserPrincipalName, bin(TimeGenerated, Account_Login_Time), AppDisplayName, UserAgent\r\n| where Failed_Attempts >= Acount_Login_Threshold\r\n| project StartTime, EndTime, UserPrincipalName, AppDisplayName, Failed_Attempts, Location, UserAgent\r\n//Description",
        "size": 1,
        "showAnalytics": true,
        "title": "Multiple Sign-in Authentication Failed Within 10 min",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "table",
        "sortBy": [],
        "tileSettings": {
          "titleContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        }
      },
      "customWidth": "70",
      "showPin": true,
      "name": "Multiple Authentication Failed Within 10 min",
      "styleSettings": {
        "maxWidth": "70%",
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType == 0\r\n| extend latitude = tostring(parse_json(tostring(LocationDetails.geoCoordinates)).latitude)\r\n| extend longitude = tostring(parse_json(tostring(LocationDetails.geoCoordinates)).longitude)\r\n| summarize count() by UserPrincipalName,AppDisplayName,Location,latitude,longitude",
        "size": 3,
        "showAnalytics": true,
        "title": "Sign-in Success Location by Map",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "map",
        "sortBy": [],
        "tileSettings": {
          "titleContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        },
        "mapSettings": {
          "locInfo": "CountryRegion",
          "locInfoColumn": "Location",
          "latitude": "latitude",
          "longitude": "longitude",
          "sizeSettings": "count_",
          "sizeAggregation": "Sum",
          "minSize": 20,
          "maxSize": 30,
          "defaultSize": 10,
          "labelSettings": "Location",
          "legendMetric": "count_",
          "legendAggregation": "Sum",
          "itemColorSettings": {
            "nodeColorField": "count_",
            "colorAggregation": "Sum",
            "type": "heatmap",
            "heatmapPalette": "greenRed"
          }
        }
      },
      "showPin": true,
      "name": "Sign-in Success Location by Map",
      "styleSettings": {
        "showBorder": true
      }
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| where ResultType != 0\r\n| extend latitude = tostring(parse_json(tostring(LocationDetails.geoCoordinates)).latitude)\r\n| extend longitude = tostring(parse_json(tostring(LocationDetails.geoCoordinates)).longitude)\r\n| summarize count() by UserPrincipalName,AppDisplayName,Location,latitude,longitude",
        "size": 3,
        "showAnalytics": true,
        "title": "Sign-in Fail Location by Map",
        "noDataMessageStyle": 3,
        "timeContextFromParameter": "Date_Time",
        "showRefreshButton": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "map",
        "sortBy": [],
        "tileSettings": {
          "titleContent": {
            "columnMatch": "UserPrincipalName",
            "formatter": 1
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "palette": "auto"
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "showBorder": false,
          "size": "auto"
        },
        "mapSettings": {
          "locInfo": "CountryRegion",
          "locInfoColumn": "Location",
          "latitude": "latitude",
          "longitude": "longitude",
          "sizeSettings": "count_",
          "sizeAggregation": "Sum",
          "minSize": 20,
          "maxSize": 30,
          "defaultSize": 10,
          "labelSettings": "Location",
          "legendMetric": "count_",
          "legendAggregation": "Sum",
          "itemColorSettings": {
            "nodeColorField": "count_",
            "colorAggregation": "Sum",
            "type": "heatmap",
            "heatmapPalette": "greenRed"
          }
        }
      },
      "showPin": true,
      "name": "Sign-in Success Location by Map - Copy",
      "styleSettings": {
        "showBorder": true
      }
    }
  ],
  "fallbackResourceIds": [
    "/subscriptions/6b603dab-a3f1-4bb5-afba-7c06cc45e242/resourcegroups/dlmm_soc_monitoring/providers/microsoft.operationalinsights/workspaces/bim-dlmm-la"
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}
